STMicroelectronics/STM32CubeWL/Projects/B-WL5M-SUBG1/Demonstrations/LocalNetwork_Sensor/Sensor/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "gpio.h"
#include "sys_app.h"
#include "demo_sensor.h"
#include "version.h"
#include "stm32_seq.h"
#include "stm32_timer.h"
#include "adc_if.h"
#include "meters.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define SENS_LED_BLINK 1
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

UTIL_TIMER_Object_t LedTimer;        /**<Timer which turns LEDs off*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
/**
 * @brief Turn all LEDs off.
 * Used as a timer callback.
 */
static void LedsOff(void* context);

/**
 * @brief Do a short blink with a LED.
 */
static void LedBlink(void);

/**
 * @brief Callback to write sensor data right before transmission.
 */
static void WriteDataCallback(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  /* USER CODE BEGIN 2 */
  SystemApp_Init();

  UTIL_TIMER_Create(&LedTimer, 125, UTIL_TIMER_ONESHOT, LedsOff, NULL);

  /************************************************
   *
   *             Sensor
   *
   ************************************************/

  APP_LOG(TS_OFF, VLEVEL_L,
          "--------------------------\r\n"
          "    Sensor Reset\r\n"
          "     %s\r\n"
          "--------------------------\r\n", APP_VERSION_STR);
  /*Init meters*/
  if(Meters_Init() != 0)
  {
    APP_LOG(TS_ON, VLEVEL_L, "Cannot init sensor!\r\n");
  }
  /*Put error data to be sent before first measurement*/
  DEMO_data_1_1_t data =
  {
      .temperature      = DEMO_DATA_1_1_ERROR_TEMPERATURE,
      .pressure         = DEMO_DATA_1_1_ERROR_PRESSURE,
      .yaw              = DEMO_DATA_1_1_ERROR_YAW,
      .pitch            = DEMO_DATA_1_1_ERROR_PITCH,
      .roll             = DEMO_DATA_1_1_ERROR_ROLL,
      .humidity         = DEMO_DATA_1_1_ERROR_HUMIDITY,
      .activity         = DEMO_DATA_1_1_ERROR_ACTIVITY,
      .distance         = DEMO_DATA_1_1_ERROR_DISTANCE,
      .step_count       = 0,
      .swipe_count      = 0,
      .acceleration_avg = DEMO_DATA_1_1_ERROR_ACCELERATION,
      .acceleration_max = DEMO_DATA_1_1_ERROR_ACCELERATION,
      .voltage          = DEMO_DATA_1_1_ERROR_VOLTAGE,
  };
  SENS_WriteSensorData(&data);

  /*Init sensor and start scanning for beacon*/
  SENS_Init(WriteDataCallback, LedBlink);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */
    UTIL_SEQ_Run( UTIL_SEQ_DEFAULT );

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_11;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the SYSCLKSource, HCLK, PCLK1 and PCLK2 clocks dividers
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK3|RCC_CLOCKTYPE_HCLK
                              |RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
                              |RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.AHBCLK3Divider = RCC_SYSCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
/**
 * @brief Callback to write sensor data right before transmission.
 */

static void WriteDataCallback(void)
{
  DEMO_data_1_1_t data;
  Meters_GetData(&data, DEMO_SLOT_NUMBER*1000);

  SENS_WriteSensorData(&data);
}

/**
 * @brief Turn all LEDs off.
 * Used as a timer callback.
 */
static void LedsOff(void* context)
{
  UNUSED(context);

#if SENS_LED_BLINK != 0
  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
  HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
#endif /*SENS_LED_BLINK*/
}

/**
 * @brief Do a short blink with a LED.
 */
static void LedBlink(void)
{
#if SENS_LED_BLINK != 0
  if(UTIL_TIMER_IsRunning(&LedTimer))    /*Timer is already running, LED flashing is too fast*/
  {
    switch(SENS_GetState())
    {
      case SENS_STATE_Connect:
        HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin); /* LED_GREEN */
        HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
        HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
        break;
      case SENS_STATE_Lost:
        HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
        HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
        HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
        break;
      case SENS_STATE_Scan:
        HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
        HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
        HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
        break;
      case SENS_STATE_Sync:
        HAL_GPIO_TogglePin(LED1_GPIO_Port, LED1_Pin); /* LED_BLUE */
        HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */
        HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
        break;
      default: break;
    }
    UTIL_TIMER_Stop(&LedTimer);
    UTIL_TIMER_Start(&LedTimer);
  }
  else
  {
    switch(SENS_GetState())
    {
      case SENS_STATE_Connect:
        HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET); /* LED_GREEN */
        break;
      case SENS_STATE_Lost:
        HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET); /* LED_RED */
        break;
      case SENS_STATE_Scan:
        HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET); /* LED_RED */
        break;
      case SENS_STATE_Sync:
        HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET); /* LED_BLUE */
        break;
      default: break;
    }
    UTIL_TIMER_Start(&LedTimer);
  }
#endif /*SENS_LED_BLINK*/
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  while (1)
  {
  }
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
